using System;
using System.Linq;

namespace FunctionalProgramming
{
    class Program
    {
        static void Main(string[] args)
        {
            //във функционалното програмиране (ФП) винаги една функция дава еднакъв резултат, няма стейт (състояние), като в ООП. Променливите са константи!
            //ФП е много силно когато едновременно се случват много процеси!
            //haskel е много добър език за учене на ФП
            //lisp и scala се много известни, ако ни е интересно ФП Виктор би ни насочил към scala!
            // F# e майкросовтския, а JS много хора го пишат по функционално и много хора с JS им се отдава функционалното програмиране.  JS е много мощен за много неща!!!
            // pattern matching в C# e функционална парадигма, която набира скорост напоследък (има базово много хубави неща).
            // лампда експрешънса е съкратен запис на метод (анонимна функция) - използват се за писане набързо и когато няма да се ползват повече - много полезни за сортиране и филтриране!!!

            //Lampda:
            int[] numbers = new int[] { 1, 2, 3, 4, 5 };
            numbers = numbers.Where(numbers => numbers % 2 == 0).ToArray();
            Console.WriteLine(string.Join(" ", numbers));
        }
    }
}
